#!/bin/bash
echo "基于葫芦侠三楼4.1.0.8.1编写"
echo "update： 2022~4~1 "
echo "作者： 嗓子干"
echo "\n葫芦侠每日登录成功\n"
echo "准备执行签到"
#葫芦侠大号签到
qd="_key=（）&cat_id={"6","1","15","34","43","81","16","44","45","96","70","111","4","29","102","71","105","107","90","115","112","21","117","110","101","56","3","88","76","57","92","98","58","82","77","63","22","23","113","103","2","108","116"}"
curl --header "User-Agent:okhttp/3.8.1" http://floor.huluxia.com/user/signin/ANDROID/4.0?$qd
echo "\n大号签到完成\n"
echo "\n所有板块签到成功，返回刷新即可\n"
